cf/BusinessProcesses/РемонтИнструмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<BusinessProcess>
		<Properties>
			<Name>РемонтИнструмента</Name>
			<Task>Task.ЗадачаПользователю</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветМенеджера</Name>
					<Comment>0 - нет ответа, 1 - ждать оплату, 2 - отсрочка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменныйИнструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнструментПринят</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГарантияСогласована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверитьОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контакты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКартинок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьГарантия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПроведенияДополнительныхРабот</Name>
					<Comment>0-проводить работы; 1-по согласованию; 2-ничего не делать</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧисткаГрязногоИнструмента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неисправность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Неисправности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гарантия</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СогласованияСКлиентом</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Comment>3 - отказ, 2 - согласовано, 1 - принят, 0 - доработать</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Картинки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КартинкиРемонта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

cf/Catalogs/Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Склады</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеСнятиеРезервов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайтВместеСОсновным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузоотправительСклада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Грузополучатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассифицироватьНоменклатуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИнтернет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаСайтеНеПоказыватьВсем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПодразделения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноПриоритетыСборки</Name>
					<Comment>Не возможно отправить заказ на сборку если не установлена очередь сборки заказа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСкладНаСайте</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгрузкаДилерам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгрузкаРозничнымКлиентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередачаТовараМВЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетСкладаДилер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетСкладаРозничныйПокупатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешенаБыстраяПродажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноПолучениеТовараПриСамовывозе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РемонтИнструмента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РозницаДляВсех</Name>
					<Comment>На этом складе разрешена отгрузка для интернет розничных покупателей регион которых явно не определен. см функцию http.СформироватьРезерв()</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладДляОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаКарту</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таможня</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоСбощикамЗаказов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ячеестый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаНеНайдено</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПеремещенияПоУмолчанию</Name>
					<Comment>Какая ячейка автоматом будет проставлятся при перемещении</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноСборочныйЛист</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоперевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКонтактногоЛицаДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорядокРазмещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вариант</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СкладыБыстрогоПеремещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/BusinessProcesses/РемонтИнструмента/Forms/ЗапускПроцесса/Ext/Form/Module.bsl
&НаСервере
Функция ЗапуститьНовыйБизнесПроцесс()
	
	Процесс 		= БизнесПроцессы.РемонтИнструмента.СоздатьБизнесПроцесс();
	Процесс.Дата 	= ТекущаяДата();
	
	ФункцииФормДокументов.ЗаполнитьЗначенияПоУмолчанию(Процесс, ФункцииФормДокументов.ПолучитьРеквизитыДокумента(Документы.ЗаказНаряд.ПустаяСсылка()));
	
	Процесс.ИнструментПринят = Истина;
	Процесс.ГарантияСогласована = Истина;
	
	Процесс.СкладПолучатель = Склад;	
	
	Если НЕ Процесс.Склад.РемонтИнструмента Тогда
		Процесс.Склад = Константы.СкладСервисПоУмолч.Получить();
	КонецЕсли;
	
	НачатьТранзакцию();
	
	// Запишем
	
	Попытка
		Процесс.Записать();
	Исключение
		
		стрОшибки = ОписаниеОшибки();
		ОбщиеФункции.СообщитьТекст("Ошибка записи нового бизнес процесса
								|" + стрОшибки);
		ОтменитьТранзакцию();
		Возврат Неопределено;
		
	КонецПопытки;
	
	// Запустим
	
	Попытка
		Процесс.Старт();
	Исключение
		
		стрОшибки = ОписаниеОшибки();
		ОбщиеФункции.СообщитьТекст("Ошибка запуска бизнес процесса
								|" + стрОшибки);
		ОтменитьТранзакцию();								
		Возврат Неопределено;
		
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	// Вернем задачу
	
	//ТипБизнесПроцесса = Метаданные.НайтиПоТипу(ТипЗнч(Процесс));
	//ПараметрыФормы = БизнесПроцессы[ТипБизнесПроцесса.Имя].ФормаВыполненияЗадачи(ЗадачаСсылка, Реквизиты.ТочкаМаршрута);
	//Возврат ПараметрыФормы;
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Задача.ЗадачаПользователю ГДЕ БизнесПроцесс = &процесс");
	Запрос.УстановитьПараметр("процесс", Процесс.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		//ЗначениеВДанныеФормы(Выборка.Ссылка.Получитьобъект(), открытьЗадачу);
		//Возврат Истина;
		
		Возврат Выборка.Ссылка;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура КнопкаПродолжить(Команда)
	
	Если Склад = Неопределено ИЛИ Склад.Пустая() Тогда
		ОбщиеФункции.СообщитьТекст("Значение не заполнено", "Склад", Склад);
		Возврат;
	КонецЕсли;
	
	// Запустим 
	
	ЗадачаСсылка = ЗапуститьНовыйБизнесПроцесс();
	
	Если ЗадачаСсылка <> Неопределено Тогда
		
		// Расспечатем
		
		Если ПечататьЗаявку Тогда
			ПечататьБланк(ЗадачаСсылка);
		КонецЕсли;
	
		// Откроем задачу процесса
		
		Если ОткрытьСледующююЗадачу Тогда
			ОткрытьФорму("БизнесПроцесс.РемонтИнструмента.Форма.Задача_ОформитьЗаявку", Новый Структура("Ключ", ЗадачаСсылка));
		КонецЕсли;
		
		// Закроем эту форму
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

// ПЕЧАТЬ

&НаСервере
Процедура ПечататьБланкНаСервере(ТабДок, ЗадачаСсылка)
	
	БизнесПроцессы.РемонтИнструмента.ПечатьБланкЗаявки(ТабДок, ЗадачаСсылка.БизнесПроцесс);
	
КонецПроцедуры
&НаКлиенте
Процедура ПечататьБланк(ЗадачаСсылка)
	
	ТабДок = Новый ТабличныйДокумент;
	ПечататьБланкНаСервере(ТабДок, ЗадачаСсылка);

	ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(ТабДок);
	
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОткрытьСледующююЗадачу = Истина;
	Склад = ОбщиеФункции.НастройкаПользователя("ПоУмолчанию_Склад");
КонецПроцедуры

&НаКлиенте
Процедура Декорация4Нажатие(Элемент)
	
	Склад = ОткрытьФорму("Справочник.Склады.ФормаВыбора",, ЭтаФорма,,,,Новый ОписаниеОповещения("ОбработкаОповещенияФормы",ЭтаФорма,));
	
КонецПроцедуры
/////
&НаКлиенте
Процедура СкладНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка =Ложь;
	Склад = ОткрытьФорму("Справочник.Склады.ФормаВыбора",,ЭтаФорма,,,,Новый ОписаниеОповещения("ОбработкаОповещенияФормы",ЭтаФорма,));
КонецПроцедуры
&НаКлиенте
Процедура ОбработкаОповещенияФормы(Результат, Параметры) Экспорт
	УправлениеВидимостьюДоступностью();	
КонецПроцедуры
//////
&НаКлиенте
Процедура УправлениеВидимостьюДоступностью()
	
	СкладНеВведен = Склад = Неопределено ИЛИ Склад.Пустая();
	
	Элементы.Декорация4.Видимость = СкладНеВведен;
    Элементы.Склад.Видимость = НЕ СкладНеВведен;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостьюДоступностью();
КонецПроцедуры
